cfd-simulation/tuna/U_1p2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       719771;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       721371;
    }
    bottom
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3200;
        startFace       722971;
    }
    top
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3200;
        startFace       726171;
    }
    sideMin
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3200;
        startFace       729371;
    }
    sideMax
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3200;
        startFace       732571;
    }
    fish
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21038;
        startFace       735771;
    }
)

// ************************************************************************* //
